app/controllers/api/v1/months_controller.rb

  def get_month
    @month = Product.where(months_available: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."months_available" = $1  [["months_available", "April"]]