app/controllers/api/v1/products_controller.rb

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Title of a Blog post"], ["updated_at", "2020-12-09 14:54:51.208564"], ["id", 1]]

  def create
    product = Product.new(product_params)
    if product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Pomme"], ["created_at", "2020-12-09 15:02:39.163865"], ["updated_at", "2020-12-09 15:02:39.163865"]]

  def destroy
    if @product && @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 5]]

  def get_product
    @product =  Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]